Repository: MacSergey/NoProblems
Catalog: NoProblems/Properties/Localize.*.resx
Languages: cs, es, ja, pl_pl, ro_ro

# Mod_Description
source: Disable problem notifications
cs: Vypnout upozornění na problémy
es: Desactivar notificaciones de problemas
ja: 問題のアイコン通知を無効化します
pl_pl: Wyłącz powiadomienia problemów
ro_ro: Dezactivează notificările referitor problemelor

# Mod_WhatsNewMessage2_0
source: [UPDATED] Added Plaza & Promenades DLC support. [UPDATED] Add new notifications from several last DLCs. [NEW] Added ability to hide normal notification, but show major notifications. [NEW] Added shortcut for toggling notifications visibility. [UPDATED] Using Harmony instead of old patching system.
cs: [UPDATED] Přidána podpora DLC Plaza & Promenades. [UPDATED] Přidána nová oznámení z několika posledních DLC. [NEW] Přidána možnost skrýt běžná oznámení, ale zobrazovat hlavní oznámení. [NEW] Přidána zkratka pro přepínání viditelnosti oznámení. [UPDATED] Použití Harmony namísto starého systému záplatování.
es: [UPDATED] Agregago soporte para DLC Plaza y Promenades. [UPDATED] Nuevas notificaciones de DLC recientes. [NEW] Habilidad para esconder notifcaciones normales, pero mostrar notificaciones importantes. [NEW] Acceso directo para cambiar la visibildad de las notificaciones. [UPDATED] Ahora usa Harmony en vez del método anterior de parches.
pl_pl: [UPDATED] Dodano wsparcie dla DLC Place & Promenady. [UPDATED] Dodaj nowe powiadomienia z kilku ostatnich DLC. [NEW] Dodano możliwość ukrycia normalne powiadomienia, ale pokazywania główne powiadomień. [NEW] Dodano skrót do przełączania wyświetlania powiadomień. [UPDATED] Używanie Harmony zamiast starego systemu patchowania.
ro_ro: [UPDATED] Adăugat suportul pentru Plazas & Promenades DLC. [UPDATED] Adăugate notificări noi de la ultimele DLC-uri. [NEW] Adăugată opțiunea de a ascund notificările normale, afișând notificările mai importante. [NEW] Adăugată comanda rapidă pentru a afișa/ascunde notificările. [UPDATED] Modul acesta acum folosește Harmony în loc de vechiul sistem de patching.

# Mod_WhatsNewMessage2_1
source: [UPDATED] Added the ability to remove problem flags at all, which will affect buildings behavior. Could be set in the mod settings. [TRANSLATION] Added Romanian translation.
cs: [UPDATED] Přidána možnost odstranit problémové příznaky úplně, což ovlivní chování budov. Může být nastaveno v nastavení módu. [TRANSLATION] Přidán Rumunský překlad.
es: [UPDATED] Habilidad para eliminar notificaciones de problemas, esto afecta el comportamiento de los edificios. Se puede copnfigurar en los ajustes del mod. [TRANSLATION] Traducción al Romano.
pl_pl: [UPDATED] Dodano możliwość zupełnego usunięcia znaczników problemów, co wpłynie na zachowanie budynków. Może to zostać ustawione w ustawieniach modyfikacji. [TRANSLATION] Dodano tłumaczenie rumuńskie.
ro_ro: [UPDATED] Adăugată opțiunea de a elimina crearea problemelor, afectând toate clădirile. Aceasta poate fi setată prin setările modului. [TRANSLATION] A fost adăugată limba română.

# Settings_AirportGroup
source: Airport notifications
cs: Letištní oznámení
es: Notificaciones de Aeropuerto
ja: 空港エリアの通知
pl_pl: Powiadomienia lotnisk
ro_ro: Notificări aeroport

# Settings_CampusGroup
source: Campus notifications
cs: Oznámení z kampusu
es: Notificaciones de Campus
ja: キャンパスエリアの通知
pl_pl: Powiadomienia kampusów
ro_ro: Notificări campus

# Settings_DisableAll
source: Disable all
cs: Zakázat vše
es: Deshabilitar todo
ja: 全て無効化
pl_pl: Wyłącz wszystkie
ro_ro: Dezactivează toate notificările

# Settings_DisableEntireGrope
source: Disable entire group
cs: Zakázat celou skupinu
es: Deshabilitar todo el grupo
ja: グループ全体で無効化
pl_pl: Wyłącz całą grupę
ro_ro: Dezactivează întregul grup

# Settings_DisastersGroup
source: Disasters notifications
cs: Oznámení o katastrofách
es: Notificaciones de Desastres
ja: 災害関係の通知
pl_pl: Powiadomienia o klęskach
ro_ro: Notificări dezastre

# Settings_EnableAll
source: Enable all
cs: Povolit vše
es: Habilitar todos
ja: 全て有効化
pl_pl: Włącz wszystkie
ro_ro: Activează toate notificările

# Settings_EnableEntireGrope
source: Enable entire group
cs: Povolit celou skupinu
es: Habilitar todo el grupo
ja: グループ全体で有効化
pl_pl: Włącz całą grupę
ro_ro: Activează întregul grup

# Settings_FishingGroup
source: Fishing notifications
cs: Oznámení rybolovu
es: Notificaciones de Pesca
ja: 漁業関係の通知
pl_pl: Powiadomienia rybołówstwa
ro_ro: Notificări pește

# Settings_GeneralGroup
source: General notifications
cs: Obecná oznámení
es: Notificaciones Generales
ja: 全般的な通知
pl_pl: Powiadomienia ogólne
ro_ro: Notificări generale

# Settings_IndustryGroup
source: Industry notifications
cs: Oznámení průmyslu
es: Notificaciones de Industrias
ja: 産業エリアの通知
pl_pl: Powiadomienia przemysłu
ro_ro: Notificări industrie

# Settings_NotConnectedGroup
source: Not connected notifications
cs: Oznámení o nepřipojení
es: Notificaciones no conectadas
ja: 未接続の通知
pl_pl: Powiadomienia o braku połączenia
ro_ro: Notificări obiecte neconectate

# Settings_OtherGroup
source: Other notifications
cs: Ostatní oznámení
es: Otras notificaciones
ja: その他の通知
pl_pl: Pozostałe powiadomienia
ro_ro: Alte notificări

# Settings_ParksGroup
source: Parks notifications
cs: Oznámení parků
es: Notificaciones de Parques
ja: パークエリアの通知
pl_pl: Powiadomienie parków
ro_ro: Notificări parc

# Settings_PedestrianGroup
source: Pedestrian area notifications
cs: Oznámení o pěší zóně
es: Notificaciones de Áreas Peatonales
ja: 歩行者エリアの通知
pl_pl: Powiadomienia terenów pieszych
ro_ro: Notificări zonă pietonală

# Settings_СonsumptionGroup
source: Сonsumption notifications
cs: Oznámení o spotřebě
es: Notificaciones de Consumo
ja: 消費関係の通知
pl_pl: Powiadomienia o konsumpcji
ro_ro: Notificări consum

# Setting_DisableProblem
source: Disable "{0}"
cs: Vypnout {0}"
es: Deshabilitar "{0}"
ja: 無効化: "{0}"
pl_pl: Wyłącz "{0}"
ro_ro: Dezactivează "{0}"

# Setting_HideAny
source: Hide any
cs: Skrýt jakékoliv
es: Ocultar cualquiera
ja: いずれかを非表示
pl_pl: Ukryj dowolne
ro_ro: Ascunde tot

# Setting_HideDescription
source: {0} — this option just hides any notifications, but buildings behavior is keeped. {1} — the same option, but only not major notifications will be hidden. {2} — this option changes buildings behavior, it prevents adding problem flags to buildings.
cs: {0} — tato možnost pouze skryje oznámení, ale chování budov je zachováno. {1} — stejná možnost, ale pouze nezásadní oznámení budou skryty. {2} — tato možnost mění chování budov, zabraňuje přidávání problémových příznaků do budov.
es: {0} — oculta las notificaciones, el comportamiento del edificio no cambia. {1} — misma opción, notificaciones no importantes se ocultarán . {2} — cambia comportamiento de los edificios, previene agregar notificaciones de problemas a los edificios.
ja: {0} - このオプションは全ての通知を非表示にしますが、建物の動作が維持されます。 {1} - 同じオプションですが、重要でない通知のみが非表示になります。 {2} - このオプションは建物の動作を変更して、建物に問題フラグを追加しません。
pl_pl: {0} — ta opcja po prostu ukryje wszystkie powiadomienia, ale zachowanie budynków jest niezmienione. {1} — ta sama opcja, ale tylko nie główne powiadomienia zostaną ukryte. {2} — ta opcja zmienia zachowanie budynków, zapobiega dodawaniu flag problemów do budynków.
ro_ro: {0} - Această opțiune afișează doar notificările referitoare la clădiri. {1} - Aceeași opțiune, afișând doar cele mai importante. {2} - Această opțiune schimbă comportamentul clădirilor, împiedicând crearea problemelor.

# Setting_HideNormal
source: Hide normal, but show major
cs: Skrýt běžné, ale zobrazit hlavní
es: Ocultar normales, pero mostrar importantes
ja: 通常は非表示で、重要な通知は表示
pl_pl: Ukryj normalne, ale pokaż główne
ro_ro: Ascunde notificările obișnuite, dar nu alea majore

# Setting_HideType
source: Hide option
cs: Skrýt volbu
es: Opción de ocultar
ja: 非表示のオプション
pl_pl: Ukryj opcję
ro_ro: Ascunde opțiunea

# Setting_Remove
source: Remove problem flags
cs: Odstranit problémové příznaky
es: Eliminar notificación de problemas
ja: 問題フラグを削除
pl_pl: Usuń znaczniki problemu
ro_ro: Împiedică crearea problemelor

# Setting_ToggleShortcut
source: Toggle visibility
cs: Přepnout viditelnost
es: Alternar visibilidad
ja: 表示の切り替え
pl_pl: Przełącz widoczność
ro_ro: Comută vizibilitatea notificărilor
